# 1) ჩამოწერეთ 10-10 მაგალითი შედარების ოპერატორებზე

n1 = 12 < 14
print(n1)
n1 = 15 < 114
print(n1)
n1 = 1 < 3
print(n1)
n1 = 2 < 6 
print(n1)
n1 = 36 < 233
print(n1)
n1 =  45 < 844
print(n1)
n1 = 16 < 828
print(n1)
n1 = 82 < 1092
print(n1)
n1 = 55 < 1234
print(n1)
n1 = 563 < 1289
print(n1)


n1 = 5 > 3
print(n1)
n1 = 10 > 3
print(n1)
n1 = 15 > 7
print(n1)
n1 = 20 > 9
print(n1)
n1 = 26 > 15
print(n1)
n1 = 137623478 > 427908
print(n1)
n1 = 5495480504570 > 32984789325
print(n1)
n1 =2437509475094 > 25748
print(n1)
n1 = 2358649569349 > 35986
print(n1)
n1 = 25964564923491 > 32389
print(n1)

n1 = 13 <= 13
print(n1)
n1 = 24 <= 25
print(n1)
n1 = 232 <= 232
print(n1)
n1 = 222 <= 234
print(n1)
n1 = 860 <= 2040
print(n1)
n1 =  3264389 <= 236532570
print(n1)
n1 = 4323794 <= 409375273940
print(n1)
n1 =  54095704 <= 473894343345
print(n1)
n1 =  454730995 <= 4301
print(n1)
n1 =  23348 <= 32937844
print(n1)

n1 = 16 >= 10
print(n1)
n1 = 12 >= 5
print(n1)
n1 = 19 >= 17
print(n1)
n1 = 10 >= 10 
print(n1)
n1 = 244 >= 3244
print(n1)
n1 = 23047304 >= 24963289374
print(n1)
n1 = 2347832750 >= 32946389
print(n1)
n1 = 384237490749 >= 43982348324
print(n1)
n1 = 34823739794 >= 43892483094
print(n1)
n1 = 4097439432 >= 7230409344
print(n1)

n1 = 213 != 232
print(n1)
n1 = 2423 != 23233
print(n1)
n1 = 422 != 422
print(n1)
n1 = 47 != 98
print(n1)
n1 = 90 != 47
print(n1)
n1 = 666666 != 668886888
print(n1)
n1 = 6779797 != 45355890
print(n1)
n1 = 55555 != 55555
print(n1)
n1 = 12345678 != 12345678
print(n1)
n1 =  543342567890 != 34567890987654
print(n1)

n1 =  15 == 15
print(n1)
n1 =  17 == 29
print(n1)
n1 =  2922 == 32
print(n1)
n1 = 383 == 383
print(n1)
n1 = 203 == 204
print(n1)
n1 = 12345678 = 12345678
print(n1)
n1 = 3434 =3434
print(n1)
n1 = 987654321 = 987654321
print(n1)
n1 = 9999 = 9999
print(n1)
n1 = 3476563 = 5354457566
print(n1)

