# 1) შევქმნათ სია (List) ჩვენ საყვარელ მანქანებზე და დავპრინტოთ

fav_car = ["mercedes G class", "dodge challenger", ]
print = (fav_car)

# 2) შევქმნათ სია (List) ჩვენ საყვარელ საჭმელზე და 
# დავპრინტოთ

fav_food = ["აწეწილი/აჩეჩილი/ ქათმის სალათი", "ხინკალი", "დდ"]
print(fav_food)

# 3)num = [1,  2,  3,   4,  5,  6,  7,   8,  9,  10] ამ სიაში დაპრინტეთ თითოეული 
# მათგანი და დაპრინტეთ 2 -იდან 8 ჩათვლით, 5 - იდან 10 ჩათვლით
num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10,]

print(num[0:10])
print(num[1:8])
print(num[4:10])
