
# 1) for loop-ში გამოიტანეთ რიცხვები 150-დან 202-ის ჩათვლით, ყოველი 2-ე

for i in range (150, 203, 2):
    print(i)
    
    
# 2) for loop-ში გამოიტანეთ რიცხვები 400-დან 200-ის ჩათვლით

for i in range(400, 199, -1):
    print(i)

# 3) თქვენი სიტყვებით ახსენით განსხვავება while და for ციკლებს შორის

# while გამოიყენება იისთვის რომ მარტივად ავაგოთ ფუნქცია "სანამ ცვლადი იქნება რაღაცაზე მეტი ან ნაკლები(გააჩნიე) დაპრინტე ეს", ხოლო for არის ფუნქცია რომლის დროსაც რაღაც განსაზღვრული რიცხვიდან რაღაცამდე დაიპრინტება ცვლადი

# 4) დაბეჭდეთ "GOA BEST!!!" 50-ჯერ, ორივე ციკლით შეასრულეთ ეს დავალება

for i in range (50):
    print("GOA BEST!!!")
    
GOA = 0

while GOA < 50:
    print("GOA BEST!!!")
    GOA += 1
    

# 5) გამოიყენეთ while loop_ი რომ, დაპრინტოთ ლუწი რიცხვები  1-დან 20-მდე

num = 0

while num < 20:
    print(num)
    num += 2