# 1) List-ის შექმნა და ელემენტების გამოტანა
# შექმენით სია, რომელიც შეიცავს 5 რიცხვს. შემდეგ გამოიტანეთ პირველი, ბოლო და შუათანაში მყოფი ელემენტები.

num1 = [1, 2, 3, 4, 5]
print(num1[0], num1[2], num1[4])

# 2) List-ის შეცვლა
# შეასწორეთ შეცდომები რასაც ხედავთ არასწორს ჩაასწორედ აუციელბლად  
num = [1, 3, 3, 4, 5, 6, 6, 8, 9, 12]

num[1] = 2
num[6] = 7
num[9] = 10
print(num)

# 3)მიწარმოეთ რამდენიმე სიტყვა  HELLOWEN იდან

v = 'HELLOWEEN'
print(v[0], v[1], v[2], v[3], v[4])
print(v[3], v[4], v[5])





# 4) შეაერთე სიტყვა რომ გამოვიდეს GOA IS THE BEST ACADEMY
num2 = ["GOA" , "MAGARIA", "NOVATORI","IS","THE", "VIRGIN", "CHAD" ,"BEST" ,"ACADEMY"]
print(num2[0], num2[3], num2[4], num2[7], num2[8])

