# 1️⃣ 📜 შექმენი სია:
# შექმენით სია, რომელიც შეიცავს 10 ელემენტს, მაგალითად: ნივთები, სახელები ან რიცხვები. 🧩 აირჩიე 10 ისეთი რამ, რაც გინდა, რომ იყოს სიაში!

nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# 2️⃣ 🔢 დაბეჭდეთ პირველი ელემენტი:
# იმისათვის, რომ ნახოთ პირველი ელემენტი, უბრალოდ „ამოირჩიე“ პირველი ნივთი თქვენს სიაში! 🎯 მაგალითად, თუ პირველი ნივთი არის 🍎, მაშინ შეამოწმე, რა არის პირველი ელემენტი.

num = ['apple', 'hello', 'waz up']
print(num[0])

# 3️⃣ 🔄 დაბეჭდეთ ელემენტები მესამე და მეშვიდე შორის:
# ამოირჩიეთ იმ ნივთების ნაწილი, რომლებიც მდებარეობს მესამე და მეშვიდე ადგილებს შორის. 🧐 ეს შეიძლება იყოს „ვაშლი“, „ბანანი“, „კარამელი“ ან რამე სხვა! 🍇🍉

num1 = [1,2,3, 'hello', 'Anna', 'Salo', 'apple', 5,]

print(num1[2], num1[3], num1[4], num1[5], num1[6],)

# 4️⃣ 🏁 დაბეჭდეთ ბოლო სამი ელემენტი:
# თქვენი სიის ბოლო სამი ნივთი! 🌟 დაიმახსოვრე: ბოლო ელემენტების ამოღება შეიძლება იყოს საინტერესო. 📱🎧🎮

n = [1, 2, 3, 4, 5, 6, 7]
print(n[4], n[5], n[6])

# 5️⃣ 🌍 დაბეჭდეთ სიის ყველა ელემენტი:
# ეს უკვე სიის სრული გამოტანა იქნება! 📝📚 ყველა ელემენტის თვალიერება და ნახვა! გამოვავლინოთ ყველა ნივთი, რაც თქვენს სიაშია! 🔍🎉

num2 = [1, 2, 3, 4, 5, 6, 'apple', 'cherry', 'home', True]
print(num2)